validation/rotatingCylinders/0/C
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
6400
(
(0.01969142648608876 1.002747232375757 0.5000000000000001)
(0.05904391670588746 1.001201068824003 0.5)
(0.09830536548571468 0.9981111257926226 0.4999999999999999)
(0.1374152345172776 0.9934821677498085 0.5)
(0.1763132192172697 0.9873213322133478 0.4999999999999999)
(0.214939341712666 0.9796381187450918 0.5)
(0.2532340433222555 0.9704443743033182 0.4999999999999999)
(0.2911382763918117 0.9597542749755801 0.5)
...
)
;

boundaryField
{
    innerWall
    {
        type            calculated;
        value           nonuniform List<vector> 
160
(
(0.01962990787953433 0.9996145181203613 0.5)
(0.05885945574345683 0.9980731849869253 0.5)
(0.09799824659284131 0.9949928953440271 0.4999999999999999)
(0.1369859312490343 0.990378398775032 0.5)
(0.1757623935281796 0.9842368104991842 0.5)
(0.2142678429360169 0.9765776004004535 0.5)
(0.2524429068604899 0.967412578425662 0.5)
(0.2902287221200109 0.9567558763744004 0.5)
...
)
;
    }
    outerWall
    {
        type            calculated;
        value           nonuniform List<vector> 
160
(
(0.03925981575906867 1.999229036240723 0.5)
(0.1177189114869137 1.996146369973851 0.4999999999999999)
(0.1959964931856827 1.989985790688054 0.5)
(0.2739718624980687 1.980756797550065 0.5)
(0.3515247870563592 1.968473620998368 0.5)
(0.4285356858720337 1.953155200800907 0.4999999999999999)
(0.5048858137209797 1.934825156851323 0.5)
(0.5804574442400217 1.913511752748801 0.5)
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
