validation/rotatingCylinders/0/Cx
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Cx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
6400
(
0.01969142648608876
0.05904391670588746
0.09830536548571468
0.1374152345172776
0.1763132192172697
0.214939341712666
0.2532340433222555
0.2911382763918117
...
)
;

boundaryField
{
    innerWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
160
(
0.01962990787953433
0.05885945574345683
0.09799824659284131
0.1369859312490343
0.1757623935281796
0.2142678429360169
0.2524429068604899
0.2902287221200109
...
)
;
    }
    outerWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
160
(
0.03925981575906867
0.1177189114869137
0.1959964931856827
0.2739718624980687
0.3515247870563592
0.4285356858720337
0.5048858137209797
0.5804574442400217
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
