validation/rotatingCylinders/0/Cy
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Cy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
6400
(
1.002747232375757
1.001201068824003
0.9981111257926226
0.9934821677498085
0.9873213322133478
0.9796381187450918
0.9704443743033182
0.9597542749755801
...
)
;

boundaryField
{
    innerWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
160
(
0.9996145181203613
0.9980731849869253
0.9949928953440271
0.990378398775032
0.9842368104991842
0.9765776004004535
0.967412578425662
0.9567558763744004
...
)
;
    }
    outerWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
160
(
1.999229036240723
1.996146369973851
1.989985790688054
1.980756797550065
1.968473620998368
1.953155200800907
1.934825156851323
1.913511752748801
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
