validation/rotatingCylinders/0/Cz
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Cz;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
6400
(
0.5000000000000001
0.5
0.4999999999999999
0.5
0.4999999999999999
0.5
0.4999999999999999
0.5
...
)
;

boundaryField
{
    innerWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
160
(
0.5
0.5
0.4999999999999999
0.5
0.5
0.5
0.5
0.5
...
)
;
    }
    outerWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
160
(
0.5
0.4999999999999999
0.5
0.5
0.5
0.4999999999999999
0.5
0.5
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
